In [3]:
import pandas as pd
import sqlalchemy as db
from sqlalchemy import text

In [4]:
engine = db.create_engine("mysql://root:root@172.16.5.4:3306/db_tm")
conn = engine.connect()

In [5]:
query = """
SELECT empresas.empresaID as empresaID, empresas.Nombre_empresa as NombreEmpresa, comuna.comunaID as comunaID,
 comuna.nombre_comuna as NombreComuna, servicio.tipo_servicio as TipoServicio
 FROM empresas 
 INNER JOIN servicio
 ON empresas.empresaID = servicio.empresaID
 INNER JOIN comuna
 ON comuna.comunaID = servicio.comunaID
"""

In [6]:
empresas_data = pd.read_sql(query, con = conn)
empresas_data

  empresaID NombreEmpresa comunaID  NombreComuna     TipoServicio
0      8080         Claro       11  PUERTO MONTT  Telefonia Movil
1      8085         ENTEL       44      VALDIVIA   Telefonia Fija
2      8090           VTR       22    CONCEPCION   Telefonia Fija
3      8095           WOM       33      SANTIAGO   Telefonia Fija

In [7]:
df = pd.read_excel('Antenas.xlsx')
df.head()

   comunaID  Antenas
0        11        5
1        22       18
2        33        2
3        44        4
4        11        7

In [8]:
antenas_data = df.groupby(['comunaID']).sum('Antenas')
antenas_data

          Antenas
comunaID
11            248
22            294
33            307
44            237

In [9]:
empresas_data['comunaID'] = empresas_data['comunaID'].astype('int')
empresas_data = pd.merge(empresas_data,antenas_data, left_on='comunaID', right_on='comunaID')
empresas_data

  empresaID NombreEmpresa  comunaID  NombreComuna     TipoServicio  Antenas
0      8080         Claro        11  PUERTO MONTT  Telefonia Movil      248
1      8085         ENTEL        44      VALDIVIA   Telefonia Fija      237
2      8090           VTR        22    CONCEPCION   Telefonia Fija      294
3      8095           WOM        33      SANTIAGO   Telefonia Fija      307

In [10]:
engine = db.create_engine("mysql://root:root@172.16.5.4:3306/dw_tm")
conn = engine.connect()

In [11]:
empresas_data.to_sql('dimEmpresas', conn, if_exists='append',index=False)
query = ('SELECT * FROM dimEmpresas')
df = pd.read_sql(query, con = conn)
df

   empresaID NombreEmpresa comunaID  NombreComuna     TipoServicio  Antenas
0       8080         Claro       11  PUERTO MONTT  Telefonia Movil      248
1       8085         ENTEL       44      VALDIVIA   Telefonia Fija      237
2       8090           VTR       22    CONCEPCION   Telefonia Fija      294
3       8095           WOM       33      SANTIAGO   Telefonia Fija      307

In [13]:
users = pd.read_excel('usuarios.xlsx')
users = users.rename(columns={'Nombre':'NombreCompleto'})
users.head()

   userID NombreCompleto PlanC
0     101         María     2G
1     102          Nushi    3G
2     103       Mohammed    4G
3     104          Jose     5G
4     105       Muhammad    2G

In [14]:
users.to_sql('dimUser',conn,if_exists='append',index= False)
query = ('SELECT * FROM dimUser')
df2 = pd.read_sql(query, con = conn)
df2.head()

   userID NombreCompleto PlanC
0     101         María     2G
1     102          Nushi    3G
2     103       Mohammed    4G
3     104          Jose     5G
4     105       Muhammad    2G

In [15]:
user_id = users['userID']
empresa_id = empresas_data['empresaID']

In [16]:
# CROSS para saber que usuario pertenece a que empresa
net_data = pd.merge(user_id,empresa_id, how = 'cross')
net_data

     userID empresaID
0       101      8080
1       101      8085
2       101      8090
3       101      8095
4       102      8080
..      ...       ...
395     199      8095
396     200      8080
397     200      8085
398     200      8090
399     200      8095

[400 rows x 2 columns]

In [17]:
import random

def gen_diasUso():
    # Generar un número aleatorio entre 0 y 30 con 0 solo decimal
    numero_aleatorio = round(random.uniform(0, 30), 0)
    # Mostrar el número aleatorio
    return numero_aleatorio

In [18]:
net_data['DiasUso'] = net_data['userID'].apply(lambda x: gen_diasUso())

In [20]:
net_data['DiasUso'] = net_data['DiasUso'].astype('int')
net_data.head()

   userID empresaID  DiasUso
0     101      8080        5
1     101      8085       20
2     101      8090       19
3     101      8095        3
4     102      8080        9

In [21]:
net_data.to_sql('FactUso',conn,if_exists='append',index=False)
query = ('SELECT * FROM FactUso')
df3 = pd.read_sql(query, con = conn)
df3.head()

   userID  empresaID  DiasUso
0     101       8080        5
1     101       8085       20
2     101       8090       19
3     101       8095        3
4     102       8080        9